Equity/us-stock-overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>US Stock Overview</title>
<!-- 2015-12-23 Wed 21:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link rel="stylesheet" href="/stylesheets/bootstrap.min.css" media="screen" />
<link rel="stylesheet" href="/stylesheets/bootstrap-responsive.min.css" media="screen" />
<link rel="stylesheet" href="/stylesheets/org.css" type="text/css" />
<link rel="SHORTCUT ICON" href="/favicon.png" type="image/x-icon" />
<link rel="icon" href="/favicon.png" type="image/ico" />
</head>
<body>
<div id="preamble" class="status">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-60502031-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

  document.addEventListener('DOMContentLoaded',function() {
      document.getElementById("table-of-contents").onclick = function() {
          var elem = document.getElementById("text-table-of-contents");
          elem.style.display = elem.style.display == "block" ? "none" : "block";
      }
  });
</script>
</div>
<div id="content">
<h1 class="title">US Stock Overview</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Overview</a></li>
<li><a href="#sec-2">Sites</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Overview</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://www.rightline.net/calendar/market-holidays.html">美股市场假期</a>
</li>
<li>開市時間
<ul class="org-ul">
<li>美國時間：9:30am-4pm
</li>
<li>香港時間：9:30pm-4am(夏令時間)，10:30pm-5am(冬令時間)
</li>
</ul>
</li>
<li>業績和營運數據
<ul class="org-ul">
<li>美國SEC規定每間公司要公佈季度業績，有些公司更會公佈每月營運數據，透明度高
</li>
<li>季度業績是Form 10-Q，年度業績是Form 10-F
</li>
<li>業績公佈日期，可到finviz, yahoo finance等查看
</li>
</ul>
</li>
<li>稅項
<ul class="org-ul">
<li>股息稅30%，在派股息時扣除
</li>
<li>填W-8BEN表後，外国人買美股可免資本增值稅
</li>
</ul>
</li>
<li>個股股息資料
<ul class="org-ul">
<li>Ex-Dividend Date=除息日
</li>
<li>Dividend Data=派發日
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Sites</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://www.freestockcharts.com/">freestockcharts</a>
<ul class="org-ul">
<li>need Microsoft Silverlight
</li>
</ul>
</li>
<li><a href="https://www.quandl.com/">quandl</a>
<ul class="org-ul">
<li>可下载
</li>
<li>無限年期
</li>
</ul>
</li>
<li><a href="https://research.stlouisfed.org/fred2/">Federal Reserve</a>
</li>
<li><a href="http://www.trefis.com/">Trefis</a>
<ul class="org-ul">
<li>分析公司产品对股票的影响
</li>
</ul>
</li>
<li><a href="http://www.sec.gov/">US Securities and Exchange Commission</a>
<ul class="org-ul">
<li><a href="http://www.sec.gov/spotlight/xbrl/viewers.shtml">Interactive Data Viewers</a>
</li>
<li><a href="http://xbrl.sec.gov/">http://xbrl.sec.gov/</a>
</li>
</ul>
</li>
<li><a href="http://stockcharts.com/">stockcharts</a>
<ul class="org-ul">
<li>主要用來看實時股價，免費用戶最長可看3年圖
</li>
<li>可從<a href="http://stockcharts.com/freecharts/sctr.html?&V=E&I=N#&S=GD">ETF強弱排名</a>中看出哪些是強板塊，
</li>
</ul>
</li>
<li><a href="http://finviz.com/">finviz</a>
<ul class="org-ul">
<li>看市場寬度，即上升下跌比例、新高新低比例、50天線上比例等
</li>
<li>Screener非常有用
</li>
<li>每日看創新高的高增長股，即New High + Sale Growth QoQ &gt; 25%，<a href="http://finviz.com/screener.ashx?v=111&s=ta_newhigh&f=fa_salesqoq_high&ft=2">连接</a>
</li>
</ul>
</li>
<li><a href="http://www.investing.com/">investing.com</a>
<ul class="org-ul">
<li>各地實時指數
</li>
<li>新聞
</li>
<li>investing.com的facebook專頁經常有更新，<a href="https://www.facebook.com/investingdotcom">这里</a>
</li>
</ul>
</li>
<li><a href="http://www.barchart.com/">barchart</a>
<ul class="org-ul">
<li>看哪些是強板塊，<a href="http://www.barchart.com/stocks/sectors/change.php">这里</a>
</li>
</ul>
</li>
<li><a href="http://www.investors.com/default.htm">investors.com</a>
<ul class="org-ul">
<li>市場、個股新聞
</li>
<li>CANSLIM知識
</li>
</ul>
</li>
<li><a href="https://www.tradingview.com/">TradingView</a>
<ul class="org-ul">
<li>大型圖表，無限年期，可在圖表畫線
</li>
</ul>
</li>
<li><a href="http://finance.yahoo.com/">yahoo finance</a>
<ul class="org-ul">
<li>股票并可下载
</li>
<li>看世界各地的市場動態
</li>
</ul>
</li>
<li><a href="https://www.google.com/finance">google finance</a>
<ul class="org-ul">
<li>看世界各地的市場動態
</li>
</ul>
</li>
<li><a href="http://stocktwits.com/">stocktwits</a>
<ul class="org-ul">
<li>股票版的Twitter，如碰上股價異動(例如大跌)，但找不到任何實時新聞，很大機會可以在網友的tweet裏找到相關資訊
</li>
<li>stocktwits的facebook專頁經常有更新，<a href="https://www.facebook.com/StockTwits">这里</a>
</li>
</ul>
</li>
<li><a href="http://www.hotstockmarket.com/">HotStockMarket.com</a>
<ul class="org-ul">
<li>Traders forum
</li>
</ul>
</li>
<li><a href="http://www.investopedia.com/">Investopedia</a>
</li>
<li><a href="http://www.marketwatch.com/">MarketWatch.com</a>
<ul class="org-ul">
<li>Market News
</li>
</ul>
</li>
<li><a href="http://seekingalpha.com/">SeekingAlpha.com</a>
<ul class="org-ul">
<li>opinions and analysis
</li>
</ul>
</li>
<li><a href="http://www.estimize.com/calendar">Estimize Earnings Calendar</a>
</li>
<li><a href="http://www.zerohedge.com/">Zero Hedge</a>
</li>
<li><a href="http://marketrealist.com/">Market Realist - Investment Research &amp; Analytics</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
<script type="text/javascript">
    /* * * CONFIGURATION VARIABLES * * */
    var disqus_shortname = 'finance-wiki';
    
    /* * * DON'T EDIT BELOW THIS LINE * * */
    (function() {
        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a></noscript>
</div>
</body>
</html>
